<template>
  <Head>
    <Title>[MH] Системы уравнений с двумя переменными</Title>
  </Head>
  <div class="w-full max-w-screen-xl container mx-auto mb-5">
    <MHeader class="my-7"/>
    <main class="pt-8 pb-16 lg:pt-16 lg:pb-24 bg-white dark:bg-gray-900 antialiased">
      <div class="flex justify-between px-4 mx-auto max-w-screen-xl ">
        <article
            class="mx-auto w-full max-w-2xl format format-sm sm:format-base lg:format-lg format-blue dark:format-invert">
          <header class="mb-4 lg:mb-6 not-format">
            <address class="flex items-center mb-6 not-italic">
              <div class="inline-flex items-center mr-3 text-sm text-gray-900 dark:text-white">
                <img class="mr-4 w-16 h-16 rounded-full"
                     src="https://flowbite.s3.amazonaws.com/blocks/marketing-ui/avatars/bonnie-green.png" alt="avatar">
                <div>
                  <a href="#" rel="author" class="text-xl font-bold text-gray-900 dark:text-white">Юлия Стрекушкина</a>
                  <p class="text-base text-gray-500 dark:text-gray-400">25 дней назад</p>
                </div>
              </div>
            </address>
            <h1 class="mb-4 text-3xl font-extrabold leading-tight text-gray-900 lg:mb-6 lg:text-4xl dark:text-white">
              Системы уравнений с двумя переменными, способы решения</h1>
          </header>
          <p class="lead">Уравнениями называются математические равенства разной степени сложности, в которых одна или
            несколько величин неизвестны. Значения всех переменных нужно найти таким образом, чтобы в результате их
            постановки в первоначальное уравнение получилось верное числовое равенство.<br>
            Под системой уравнений понимается условие, которое заключается в одновременном выполнении нескольких
            уравнений, логически связанных между собой, относительно одной или нескольких переменных. Рассмотрим все
            варианты решения систему уравнений с двумя переменными.</p>
          <h1 class="font-bold my-5 text-2xl">Основные виды систем уравнений</h1>
          <p>В математике насчитывается достаточно много видов систем уравнений. Для более удобного их изучения и
            нахождения решений их разделяют на несколько групп с определёнными характеристиками.

            Классификация помогает рассматривать системы уравнений разных видов. Первый вариант – это классифицирование
            по количеству уравнений в системе. Если оно всего одно, то его называют обычным уравнением. Если уравнений
            несколько, тогда речь идет о системе.

            Отличительным критерием для другого вида классификации является количество переменных. Если переменная одна,
            значит это уравнение с одной неизвестной, если их две – то с двумя неизвестными и т.д.

          </p>
          <h1 class="font-bold my-5 text-2xl">Основные способы решения системы уравнений</h1>
          <p>Для того чтобы решить систему уравнений с двумя переменными, необходимо определить значения пары
            переменных, которые при подстановке в каждое из уравнений обратят их в верные числовые неравенства. Если
            удалось вычислить эти значения правильно, то они и будут являться решением для всех уравнений
            рассматриваемой системы.<br><br>

            В алгебре некоторые системы уравнений могут вовсе не иметь правильных решений или наоборот их может быть
            бесконечное множество. Убедиться в этом можно, если заняться углубленным изучением данной тематики. В итоге
            можно прийти к выводу, что системы представляют собой множества решений всех ее уравнений.<br><br>

            Рассмотрим основные способы решения систем с двумя неизвестными:<br>
            1. Способ подстановки<br>
            2. Способ сложения<br>
            3. Способ введения новых переменных<br><br>
            Чтобы подробно описать принцип решения на примере первых трех способов, будем рассматривать системы линейных
            уравнений с двумя неизвестными.</p>
          <h1 class="font-bold my-5 text-2xl">Способ подстановки</h1>
          <p>Этот способ считается одним из самых понятных и часто используемых для быстрого нахождения решения. Он
            заключается в следующем:</p>
          <ul>
            <li>в любом уравнении системы <strong>y</strong> выражается через <strong>x</strong>;</li>
            <li>полученное выражение подставляется в другое уравнение в результате чего остается только одна
              неизвестная;
            </li>
            <li>после решения уравнения определяется значение <strong>x</strong>;</li>
            <li>после этого легко вычисляется переменная <strong>y</strong>.</li>
          </ul>
          <img class="my-4" src="~/assets/images/posts/systems/example1.png" alt="example1">
          <h1 class="font-bold my-5 text-2xl">Способ подстановки</h1>
          <p>Алгоритм решения системы линейных уравнений с двумя переменными заключается в выполнении последовательных
            действий:</p>
          <ul>
            <li>сначала нужно уравнять модули коэффициентов при одном неизвестном;</li>
            <li>сложить либо вычесть уравнения системы;</li>
            <li>решить объединенное уравнение и найти значение одной переменной;</li>
            <li>вычислить второе неизвестное.</li>
          </ul>
          <p>Рассмотрим решение с помощью этого способа на том же примере.</p>
          <img src="~/assets/images/posts/systems/example2.png" alt="example2">
          <h1 class="font-bold my-5 text-2xl">Способ введения переменных</h1>
          <p>Этот способ позволяет упростить исходную систему квадратных уравнений для последующего решения в линейном виде.</p>
          <img src="~/assets/images/posts/systems/example3.png" alt="example3">
        </article>
      </div>
    </main>
  </div>
  <MFooter class="mt-2"/>
</template>

<script>
import MHeader from "~/components/header.vue";
import MFooter from "~/components/footer.vue";

export default {
  name: "MPostSystems",
  components: {MFooter, MHeader}
}
</script>