<template>
  <Head>
    <Title>[MH] Объем параллелепипеда</Title>
  </Head>
  <div class="w-full max-w-screen-xl container mx-auto mb-5">
    <MHeader class="my-7" />
    <main class="pt-8 pb-16 lg:pt-16 lg:pb-24 bg-white dark:bg-gray-900 antialiased">
      <div class="flex justify-between px-4 mx-auto max-w-screen-xl ">
        <article
            class="mx-auto w-full max-w-2xl format format-sm sm:format-base lg:format-lg format-blue dark:format-invert">
          <header class="mb-4 lg:mb-6 not-format">
            <address class="flex items-center mb-6 not-italic">
              <div class="inline-flex items-center mr-3 text-sm text-gray-900 dark:text-white">
                <img class="mr-4 w-16 h-16 rounded-full"
                     src="https://flowbite.s3.amazonaws.com/blocks/marketing-ui/avatars/bonnie-green.png" alt="avatar">
                <div>
                  <a href="#" rel="author" class="text-xl font-bold text-gray-900 dark:text-white">Юлия Стрекушкина</a>
                  <p class="text-base text-gray-500 dark:text-gray-400">14 дней назад</p>
                </div>
              </div>
            </address>
            <h1 class="mb-4 text-3xl font-extrabold leading-tight text-gray-900 lg:mb-6 lg:text-4xl dark:text-white">
              Объем параллелепипеда</h1>
          </header>
          <h1 class="font-bold my-5 text-2xl">Что такое объем параллелепипеда</h1>
          <p>Объем – это геометрическая характеристика любого трехмерного объекта, им обладает в том числе и параллелепипед. Объемом называется размер (или вместимость) занимаемого трехмерной фигурой пространства.
            <br><br>
            Говоря об объеме параллелепипеда простыми словами, можно привести в пример обыкновенный прямоугольный аквариум: сколько воды в него поместится – таков и его объем.
          </p>
          <h1 class="font-bold my-5 text-2xl">Формулы объема прямоугольного параллелепипеда</h1>
          <p>Как и любую геометрическую величину, объем параллелепипеда можно выразить через другие измерения рассматриваемого объекта. В случае с прямоугольным параллелепипедом для вычисления его объема достаточно параметров, которые можно определить простым измерением. Рассмотрим несколько формул.</p>
          <h1 class="font-bold my-5 text-2xl">Через три стороны</h1>
          <p>Самый простой способ нахождения объема прямоугольного параллелепипеда – измерить три его стороны (иначе называемых ребрами), выходящие из одной вершины, то есть из одного угла. После этого полученные длины необходимо перемножить.
            <br><br>
            V = a ∙ b ∙ c, где V – объем параллелепипеда, a, b и c – длины трех его сторон.</p>
          <h1 class="font-bold my-5 text-2xl">Через через площадь основания и высоту</h1>
          <p>Еще одним популярным способом вычисления объема параллелепипеда является перемножение площади его основания и высоты.
            <br><br>
            V = S ∙ h, где V – объем параллелепипеда, S – площадь основания, h – высота</p>
          <h1 class="font-bold my-5 text-2xl">Через длины сторон основания и высоту</h1>
          <p>Так как площадь основания легко вычислима перемножением длин его сторон, легко вывести еще одну формулу – через длины сторон основания и высоту фигуры.
            <br><br>
            V = a ∙ b ∙ h, где V – объем параллелепипеда, a, b – длины сторон основания, h – высота.</p>
          <h1 class="font-bold my-5 text-2xl">Формулы объема наклонного параллелепипеда</h1>
          <p>Наклонный параллелепипед – это такой шестигранник, каждая грань которого представляет собой параллелограмм.
            <br><br>
            Перед вычислением объема наклонного параллелепипеда первым делом необходимо определить его высоту. Для этого опускаем перпендикуляр – вектор, направленный из вершины под прямым углом к плоскости основания, причем точка пересечения с плоскостью может лежать вне пределов основания.

            <br><br>
            Длину высоты вычисляем с помощью формулы высоты параллелограмма. Нам необходимо знать длину бокового ребра, а также угол между основанием и этим ребром.
            <br><br>
            h = с ∙ sin(aс), где h – высота, с – длина стороны, sin(aс) – синус угла между стороной и основанием.
            <br><br>
            Если основание рассматриваемой фигуры – прямоугольник, тогда вычисляем его площадь простым перемножением длин сторон. Если же основание – параллелограмм, тогда вычисляем площадь по следующей формуле:
            <br><br>
            S = a ∙ b ∙ sin(ab), где S – площадь основания, a и b – длины сторон, sin(ab) – синус угла между ними.
            <br><br>
            Заметим, что для прямоугольного основания эта формула также применима, поскольку синус прямого угла равен единице.
            <br><br>
            Получим итоговую формулу для объема наклонного параллелепипеда:
            <br><br>
            V = a ∙ b ∙ c ∙ sin(ab) ∙ sin(ac) = S*h, где V – объем параллелепипеда, a, b, c – длины ребер, ab и ac – углы между соответствующими ребрами</p>
        </article>
      </div>
    </main>
  </div>
  <MFooter class="mt-2" />
</template>

<script>
import MHeader from "~/components/header.vue";
import MFooter from "~/components/footer.vue";

export default {
  name: "MPostVolumes",
  components: {MFooter, MHeader}
}
</script>